backend/1c-config/TradeUkr23/src/Catalogs/венд_МобильныеУстройства.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>венд_МобильныеУстройства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта каталогу й замовлень пристрою; не задано = регламентована (грн). Ціни прайсу перераховуються в неї</Comment>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыЦен</Name>
					<Comment>Доступні типи цін для вибору в каталозі. Порожньо = лише основний (ТипЦен)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<Attribute>
				<Properties>
					<Name>АвтоПроведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаИсторииЗаказов</Name>
					<Comment>0 (не задано) = 30 днів за замовчуванням</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

backend/1c-config/TradeUkr23/src/InformationRegisters/венд_ТелеметрияУстройств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>венд_ТелеметрияУстройств</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследняяАктивность</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследняяСинхронизация</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запросы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СетевыеТаймауты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Устройство</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.венд_МобильныеУстройства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Form>ФормаЗаписи</Form>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

backend/1c-config/TradeUkr23/src/Catalogs/венд_МобильныеУстройства/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СлужебныйПользовательОтсутствует = НетСлужебногоПользователя();
	// Обчислювані колонки рахуються ПРЯМО в запиті дин.списку через параметри — без
	// серверних подій (ПриПолученииДанныхНаСервере на частині платформ у режимі 8.2.13
	// не викликається). «Запросы (24 ч)» (#69) — підзапит по регістру телеметрії (вікно
	// доби фіксується на момент відкриття); «Запит логу» — членство у параметрі-масиві
	// зі сховища (освіжається після кнопки «Запросити лог»).
	Список.Параметры.УстановитьЗначениеПараметра("НачалоСуток", ТекущаяДатаСеанса() - 86400);
	ОбновитьПризнакиЗапросаЛога();

КонецПроцедуры

// Немає службового користувача ІБ "vendo" (від нього працює публікація сервісу й неймспейс
// ХранилищеОбщихНастроек) — пропонуємо створити просто зі списку пристроїв.
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если СлужебныйПользовательОтсутствует Тогда

		Вопрос = НСтр("uk='Службового користувача «vendo» (від нього працює HTTP-сервіс і сховище налаштувань застосунку) не знайдено. Створити зараз?';
			|ru='Служебный пользователь «vendo» (под ним работает HTTP-сервис и хранилище настроек) не найден. Создать сейчас?';
			|en='Service user «vendo» (runs the HTTP service and settings storage) was not found. Create it now?'");
		Оповещение = Новый ОписаниеОповещения("ПредложитьСоздатьПользователяЗавершение", ЭтаФорма);
		ПоказатьВопрос(Оповещение, Вопрос, РежимДиалогаВопрос.ДаНет);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Налаштування сервісу (#52): окрема форма з адресою публікації і числовими параметрами
// (усе у ХранилищеОбщихНастроек, неймспейс "vendo" — див. модуль менеджера довідника).
&НаКлиенте
Процедура НастройкиСервиса(Команда)

	ОткрытьФорму("Справочник.венд_МобильныеУстройства.Форма.НастройкиСервиса", , ЭтаФорма);

КонецПроцедуры

// Журнал телеметрії (#42): список записів регістра з відбором за поточним пристроєм
// (без вибору — весь журнал). Відкриття запису показує збережений лог.
// ТекущаяСтрока, а не ТекущиеДанные.Ссылка: на клієнт динамічний список віддає лише
// видимі колонки, поля Ссылка серед них немає; для списку з основною таблицею
// ТекущаяСтрока — це і є посилання.
&НаКлиенте
Процедура ОткрытьТелеметрию(Команда)

	ПараметрыФормы = Новый Структура;
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;

	Если ТипЗнч(ТекущаяСтрока) = Тип("СправочникСсылка.венд_МобильныеУстройства") Тогда

		Отбор = Новый Структура("Устройство", ТекущаяСтрока);
		ПараметрыФормы.Вставить("Отбор", Отбор);

	КонецЕсли;

	ОткрытьФорму("РегистрСведений.венд_ТелеметрияУстройств.ФормаСписка", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

// Запит повного логу з виділених пристроїв: ставимо прапорець у ХранилищеОбщихНастроек
// (не в елементі довідника). Пристрій надішле журнал за наступного сеансу зв'язку (~15 хв),
// прапорець згасне сам. Стан видно в колонці «Запит логу»: базово — параметр-масив у
// запиті списку (оновлюється тут же), а подія списку (де викликається) освіжає живцем.
&НаКлиенте
Процедура ЗапроситьЛог(Команда)

	Выделенные = Элементы.Список.ВыделенныеСтроки;
	Если Выделенные.Количество() = 0 Тогда

		ПоказатьПредупреждение(, НСтр("uk='Виберіть пристрій (або кілька) у списку.';
			|ru='Выберите устройство (или несколько) в списке.';
			|en='Select a device (or several) in the list.'"));
		Возврат;

	КонецЕсли;

	Обработано = ЗапроситьЛогНаСервере(Выделенные);
	ОбновитьПризнакиЗапросаЛога(); // ✔ у колонці — одразу, не чекаючи перевідкриття
	Элементы.Список.Обновить();
	Шаблон = НСтр("uk='Запит логу поставлено (%1). Прийде за наступного сеансу зв''язку.';
		|ru='Запрос лога поставлен (%1). Придёт при следующем сеансе связи.';
		|en='Log requested (%1). It will arrive on next contact.'");
	ПоказатьПредупреждение(, СтрЗаменить(Шаблон, "%1", Строка(Обработано)));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Поставити прапорець запиту логу у сховище для виділених пристроїв (за ідентифікатором).
&НаСервереБезКонтекста
Функция ЗапроситьЛогНаСервере(Ссылки)

	Количество = 0;
	Для Каждого Ссылка Из Ссылки Цикл

		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.венд_МобильныеУстройства")
			И ЗначениеЗаполнено(Ссылка) Тогда

			Справочники.венд_МобильныеУстройства.УстановитьЗапросЛога(Ссылка.ИдентификаторУстройства, Истина);
			Количество = Количество + 1;

		КонецЕсли;

	КонецЦикла;
	Возврат Количество;

КонецФункции

// Прапорці «Запит логу» — у параметр-масив запиту списку (Ссылка В (&УстройстваСЗапросомЛога)):
// базове значення колонки живе в самому запиті й працює на будь-якій платформі.
// Викликається при створенні форми і одразу після кнопки «Запросити лог».
&НаСервере
Процедура ОбновитьПризнакиЗапросаЛога()

	Список.Параметры.УстановитьЗначениеПараметра("УстройстваСЗапросомЛога",
		Справочники.венд_МобильныеУстройства.УстройстваСЗапрошеннымЛогом());

КонецПроцедуры

// Обчислювані колонки списку: «Запит логу» — з ХранилищеОбщихНастроек; «Запросы (24 ч)»
// (#69) — свіжа сума за добу поверх значення з запиту.
// ⚠️ Платформозалежність (спостережено 10.07.2026, конфігурація в режимі сумісності 8.2.13):
// BAF 8.3.19.1529 подію викликає, 1С:Підприємство 8.3.25.1394 — НІ (нові збірки дотримуються
// обмеження «подія працює з режиму сумісності 8.3.8+», зміни платформи 8.3.10). Тому базове
// значення колонки «Запросы (24 ч)» дає ПІДЗАПИТ у самому запиті списку (&НачалоСуток,
// вікно фіксується при відкритті) — працює скрізь; цей обробник там, де викликається,
// лише освіжає вікно доби при перечитуванні порції.
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(Элемент, Настройки, Строки)

	Устройства = Новый Массив;
	Для Каждого КлючИЗначение Из Строки Цикл

		Устройства.Добавить(КлючИЗначение.Ключ);

	КонецЦикла;
	ЗапросыЗаСутки = ЗапросыУстройствЗаСутки(Устройства);

	Для Каждого КлючИЗначение Из Строки Цикл

		Данные = КлючИЗначение.Значение.Данные;
		Если Данные.Свойство("ИдентификаторУстройства") И ЗначениеЗаполнено(Данные.ИдентификаторУстройства) Тогда

			Данные.ЗапросЛога = Справочники.венд_МобильныеУстройства.ЗапрошенЛог(Данные.ИдентификаторУстройства);

		КонецЕсли;
		Если Данные.Свойство("ЗапросыЗаСутки") Тогда

			Значение = ЗапросыЗаСутки.Получить(КлючИЗначение.Ключ);
			Данные.ЗапросыЗаСутки = ?(Значение = Неопределено, 0, Значение);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Кількість запитів кожного пристрою до сервісу за останню добу (#69): сума поля
// Запросы по снапшотах телеметрії. Самозвіт додатка (без /health) — серверного обліку
// запитів навмисно немає. Повертає Соответствие: посилання пристрою → число.
&НаСервереБезКонтекста
Функция ЗапросыУстройствЗаСутки(Устройства)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Устройства", Устройства);
	Запрос.УстановитьПараметр("Начало", ТекущаяДатаСеанса() - 86400);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Телеметрия.Устройство КАК Устройство,
	|	СУММА(Телеметрия.Запросы) КАК Запросы
	|ИЗ
	|	РегистрСведений.венд_ТелеметрияУстройств КАК Телеметрия
	|ГДЕ
	|	Телеметрия.Период >= &Начало
	|	И Телеметрия.Устройство В (&Устройства)
	|СГРУППИРОВАТЬ ПО
	|	Телеметрия.Устройство";

	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Результат.Вставить(Выборка.Устройство, Выборка.Запросы);

	КонецЦикла;
	Возврат Результат;

КонецФункции

// Немає користувача ІБ "vendo"? Перегляд користувачів вимагає адмінправ — без них не
// набридаємо (вважаємо, що є).
&НаСервереБезКонтекста
Функция НетСлужебногоПользователя()

	Попытка

		Возврат ПользователиИнформационнойБазы.НайтиПоИмени("vendo") = Неопределено;

	Исключение

		Возврат Ложь;

	КонецПопытки;

КонецФункции

// Погодився створити → запитуємо пароль. У код пароль НЕ зашиваємо (репозиторій публічний);
// оператор вводить той самий пароль, що в публікації HTTP-сервісу.
&НаКлиенте
Процедура ПредложитьСоздатьПользователяЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда

		Возврат;

	КонецЕсли;

	Подсказка = НСтр("uk='Пароль користувача vendo (той самий, що в публікації сервісу)';
		|ru='Пароль пользователя vendo (тот же, что в публикации сервиса)';
		|en='Password for vendo (same as in the service publication)'");
	Оповещение = Новый ОписаниеОповещения("СоздатьПользователяСПаролем", ЭтаФорма);
	ПоказатьВводСтроки(Оповещение, "", Подсказка, 100, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПользователяСПаролем(Пароль, ДополнительныеПараметры) Экспорт

	Если Пароль = Неопределено Тогда

		Возврат; // скасовано

	КонецЕсли;

	ТекстОшибки = СоздатьСлужебногоПользователя(Пароль);
	Если ПустаяСтрока(ТекстОшибки) Тогда

		СлужебныйПользовательОтсутствует = Ложь;
		ПоказатьПредупреждение(, НСтр("uk='Користувача vendo створено. Вкажіть його в публікації HTTP-сервісу.';
			|ru='Пользователь vendo создан. Укажите его в публикации HTTP-сервиса.';
			|en='User vendo created. Set it in the HTTP service publication.'"));

	Иначе

		ПоказатьПредупреждение(, ТекстОшибки);

	КонецЕсли;

КонецПроцедуры

// Створення користувача ІБ vendo: стандартна автентифікація + роль венд_HTTPСервис.
// Потребує адмінправ; без них повертає текст помилки (форму не ламаємо).
&НаСервереБезКонтекста
Функция СоздатьСлужебногоПользователя(Пароль)

	Попытка

		Если ПользователиИнформационнойБазы.НайтиПоИмени("vendo") <> Неопределено Тогда

			Возврат ""; // уже створений

		КонецЕсли;

		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = "vendo";
		Пользователь.ПолноеИмя = "Vendo (сервіс мобільного застосунку)";
		Пользователь.АутентификацияСтандартная = Истина;
		Пользователь.Пароль = Пароль;
		Пользователь.ПоказыватьВСпискеВыбора = Ложь;
		Пользователь.Роли.Очистить();
		Пользователь.Роли.Добавить(Метаданные.Роли.венд_HTTPСервис);
		Пользователь.Записать();
		Возврат "";

	Исключение

		Возврат КраткоеПредставлениеОшибки(ИнформацияОбОшибке());

	КонецПопытки;

КонецФункции

#КонецОбласти
